package jdbc.ex;

public class Ex3 {
    /*
    연습문제 : 사용자 정보 업데이트
    요구사항: 사용자로부터 userId, username, password, age, email을 입력받아 해당 userId를 가진 사용자의 정보를 업데이트하세요.

    사용자로부터 다음 정보를 입력받습니다:
    userId: 업데이트할 사용자 ID
    username: 새 사용자 이름
    password: 새 비밀번호
    age: 새 나이
    email: 새 이메일 주소
    입력받은 정보를 데이터베이스의 users 테이블에 업데이트합니다.
     */

    /* 수정 출력예시

    사용자 ID를 입력하세요: summer
    새 사용자 이름을 입력하세요: 초여름
    새 비밀번호를 입력하세요: 1234
    새 나이를 입력하세요: 25
    새 이메일 주소를 입력하세요: cho@summer.com
    사용자 ID summer의 정보가 성공적으로 업데이트되었습니다.

    사용자 ID를 입력하세요: summer
    새 사용자 이름을 입력하세요: 초여름
    새 비밀번호를 입력하세요: (사용자가 입력 없이 엔터)
    새 나이를 입력하세요: 25
    새 이메일 주소를 입력하세요: (사용자가 입력 없이 엔터)
    사용자 ID summer의 정보가 성공적으로 업데이트되었습니다.

    - 비밀번호와 이메일주소는 기존값을 유지
    */
}
